Tekla.Structures.Model.ModelExtensions
The Tekla.Structures.Model.ModelExtensions class provides a set of extension methods for querying the Tekla.Structures.Model.Model.

Tekla.Structures.Model.ModelExtensions.GetObjectsByBoundingBoxInGlobalPlane``1(Tekla.Structures.Model.Model,Tekla.Common.Geometry.AxisAlignedBox3,System.Func{``0,System.Boolean})
Gets the objects by the given bounding box in the global plane.
Remarks:
This has to be done like this because otherwise GetObjectsByBoundingBox won't work.
See TestTrack item #80159 for more information.
The type of the model objects to be returned.
model: The model instance.
boundingBox: The bounding box.
validateFunction: The function which is used to validate if an object is valid for selection.
Returns: The objects that collide with the bounding box.

Tekla.Structures.Model.ModelExtensions.GetObjectsByBoundingBoxFromView(Tekla.Structures.Model.Model,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Gets the visible parts or pour objects which are inside a bounding box in a visible view.
model: The model instance.
minPoint: The minimum point of the bounding box.
maxPoint: The maximum point of the bounding box.
Returns: A model object enumerator of the visible objects which are inside the bounding box in the view.